12/data/attachments/9b1c0bbd545bd9e1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Katie_but_Friend_70618_8</nif:username>
            <nif:friendToBeRequested>soap_friends_969af944-d2f4-4ef0-a2bb-438e86edbf98</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>